In [51]:
import matplotlib.pyplot as plt
import pandas as pd

In [52]:
df = pd.read_csv('healthExpenditure.csv')

In [53]:
# Convert all columns to lowercase
df.columns = df.columns.str.lower().str.replace(" ", "_")

In [54]:
df.head()

  geo  time_period  obs_value
0  AL         2009        NaN
1  AL         2010        NaN
2  AL         2011        NaN
3  AL         2012        NaN
4  AL         2013        NaN

In [55]:
# Replace all NaN with 0
df.fillna(0, inplace=True)
df.head()

  geo  time_period  obs_value
0  AL         2009        0.0
1  AL         2010        0.0
2  AL         2011        0.0
3  AL         2012        0.0
4  AL         2013        0.0

In [56]:
# df.dtypes

In [57]:
df_life = pd.read_csv('tps00205.csv')

In [58]:
# Convert all columns to lowercase
df_life.columns = df_life.columns.str.lower().str.replace(" ", "_")

In [59]:
df_life.head()

  geo  time_period  obs_value
0  AL         2010        NaN
1  AL         2011        NaN
2  AL         2012        NaN
3  AL         2013       77.9
4  AL         2014       78.2

In [60]:
# Replace all NaN with 0
df_life.fillna(0, inplace=True)
df_life.head()

  geo  time_period  obs_value
0  AL         2010        0.0
1  AL         2011        0.0
2  AL         2012        0.0
3  AL         2013       77.9
4  AL         2014       78.2

In [61]:
df_life.rename(columns={'obs_value': 'life'}, inplace=True)

In [48]:
# df['merge_index'] = df['geo'] + df['time_period'].astype(str)
# df_life['merge_index'] = df_life['geo'] + df_life['time_period'].astype(str)

In [62]:
# perform inner join
df3 = pd.merge(df, df_life, on=['geo', 'time_period'], how='inner')

In [63]:
df3

    geo  time_period  obs_value  life
0    AL         2010       0.00   0.0
1    AL         2011       0.00   0.0
2    AL         2012       0.00   0.0
3    AL         2013       0.00  77.9
4    AL         2014       0.00  78.2
..   ..          ...        ...   ...
402  UK         2016    2824.06  81.2
403  UK         2017    2883.22  81.3
404  UK         2018    2950.72  81.3
405  UK         2019    3139.30   0.0
406  UK         2020       0.00   0.0

[407 rows x 4 columns]

In [74]:
# filter values equal to zero in column value1 or column value2
df_filtered = df3.loc[(df3['obs_value'] != 0) & (df3['life'] != 0)]

# display result
df_filtered

    geo  time_period  obs_value  life
11   AT         2010    3247.00  80.7
12   AT         2011    3302.65  81.1
13   AT         2012    3429.78  81.1
14   AT         2013    3495.89  81.3
15   AT         2014    3553.70  81.6
..   ..          ...        ...   ...
400  UK         2014    2764.35  81.4
401  UK         2015    2805.85  81.0
402  UK         2016    2824.06  81.2
403  UK         2017    2883.22  81.3
404  UK         2018    2950.72  81.3

[306 rows x 4 columns]

In [75]:
df_filtered.to_csv('healthExpenditure2.csv', index=False)

In [ ]:
Country = 'Italy'
test = df[df['geo'] == 'IT']
test.head()

In [ ]:
fig, axs = plt.subplots(figsize=(12, 3))
axs.scatter(test['time_period'], test['obs_value'])
plt.title(Country)
plt.xlabel('Life Expectancy')
plt.ylabel('NUTS2')
# plt.yscale('log')
plt.show()